In [2]:
import pandas as pd

In [4]:
stores = pd.read_csv('../Data/Original/50_SupermarketBranches.csv')
customers = pd.read_csv('../Data/Original/Supermarket_CustomerMembers.csv')

In [5]:
stores.head()

,AdvertisementSpend,PromotionSpend,AdministrationSpend,State,Profit
0,165349.20,136897.80,471784.10,New York,192261.83
1,162597.70,151377.59,443898.53,California,191792.06
2,153441.51,101145.55,407934.54,Florida,191050.39
3,144372.41,118671.85,383199.62,New York,182901.99
4,142107.34,91391.77,366168.42,Florida,166187.94

In [6]:
customers.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40